[
  {
    "plot": "Backstory",
    "definition": "Story that precedes events in the story being told—past events or background that add meaning to current circumstances,",
    "example": "Though The Lord of the Rings trilogy takes place in a relatively short period towards the end of the 3021-year Third Age, the narration gives glimpses of the mythological and historical events which took place earlier in the Third age leading up to the action in the novel, and in the First and Second Age."
  },
  {
    "plot": "Cliffhanger",
    "definition": "The narrative ends unresolved, to draw the audience back to a future episode for the resolution. ",
    "example": "Almost every episode of the TV shows like Dexter and Breaking Bad ends with one of the characters in a predicament (about to be caught by thugs, about to be exposed by the authorities, or a family member or a friend finds out the main character's dirty secret)."
  },
  {
    "plot": "Deus ex machina (a machination, or act of god; lit. “god out of the machine”) ",
    "definition": "Resolving the primary conflict by a means unrelated to the story (e.g., a god appears and solves everything). This device dates back to ancient Greek theater, but can be a clumsy method that frustrates the audience. ",
    "example": "The phrase originates from Medea, an ancient Greek drama. An example occurs in Mighty Aphrodite and the Tamil movie Inga Enna Solluthu."
  },
  {
    "plot": "Eucatastrophe",
    "definition": "Coined by J. R. R. Tolkien, a climactic event through which the protagonist appears to be facing a catastrophic change. However, this change does not materialize and the protagonist finds himself as the benefactor of such a climactic event; contrast peripety/peripateia. ",
    "example": "At the end of The Lord of the Rings, Gollum forcibly takes away the Ring from Frodo, suggesting that Sauron would eventually take over Middle Earth. However, Gollum celebrates too eagerly and clumsily falls into the lava, whereby the ring is destroyed and with it Sauron's power. In a way, Gollum does what Frodo and the Fellowship of the Ring intended to do through the whole plot of the trilogy, which was to throw the ring into the lake of fire in the heart of Mount Doom."
  },
  {
    "plot": "Flashback (or analeptic reference)",
    "definition": "General term for altering time sequences, taking characters back to the beginning of the tale, for instance ",
    "example": "The story of 'The Three Apples' in Arabian Nights tale begins with the discovery of a young woman's dead body. After the murderer later reveals himself, he narrates his reasons for the murder as a flashback of events leading up to the discovery of her dead body at the beginning of the story."
  },
  {
    "plot": "Flashforward",
    "definition": "Also called prolepsis, a scene that temporarily jumps the narrative forward in time. Flashforwards often represent events expected, projected, or imagined to occur in the future. They may also reveal significant parts of the story that have not yet occurred, but soon will in greater detail. ",
    "example": "Occurs in A Christmas Carol when Mr. Scrooge visits the ghost of the future. It is also frequent in the later seasons of the television series Lost."
  },
  {
    "plot": "Foreshadowing",
    "definition": "Implicit yet intentional efforts of an author to suggest events which have yet to take place in the process of narration. See also repetitive designation and Chekhov's gun ",
    "example": "A narration might begin with a male character who has to break up a schoolyard fight among some boys who are vying for the attention of a girl, which was introduced to foreshadow the events leading to a dinner time squabble between the character and his twin brother over a woman, whom both are courting at the same time."
  },
  {
    "plot": "Frame story or a story within a story",
    "definition": "A main story that hatches a linking series of shorter stories. ",
    "example": "Early examples include Panchatantra, Kalila and Dimna, Arabian Nights, and The Decameron. More modern examples are Brian Jacques’s 1999 The Legend of Luke and Ramsay Wood’s 2011 Kalila and Dimna update, subtitled Fables of Conflict and Intrigue."
  },
  {
    "plot": "Framing device",
    "definition": "A single action, scene, event, setting, or any element of significance at the beginning and end of a work. The use of framing devices allows frame stories to exist. ",
    "example": "In Arabian Nights, Scheherazade, the newly wed wife to the King, is the framing device. As a character, she is telling the '1,001 stories' to the King, in order to delay her execution night by night. However, as a framing device her purpose for existing is to tell the same 1,001 stories to the reader."
  },
  {
    "plot": "MacGuffin",
    "definition": "A plot device coined by Alfred Hitchcock referring to some goal, desired object, or other motivator that the protagonist pursues, often with little or no narrative explanation as to why it is considered so important. ",
    "example": "The Maltese Falcon is a powerful MacGuffin in the film of the same name, a supposedly jewel encrusted black bird which creates the greed which propels every character, even the hero."
  },
  {
    "plot": "In medias res",
    "definition": "Beginning the story in the middle of a sequence of events. A specific form of narrative hook. ",
    "example": "The Iliad and the Odyssey of Homer are prime examples. The latter work begins with the return of Odysseus to his home of Ithaka and then in flashbacks tells of his ten years of wandering following the Trojan War."
  },
  {
    "plot": "Narrative hook",
    "definition": "Story opening that 'hooks' readers' attention so they will keep reading ",
    "example": "Any non-fiction book is often introduced with an interesting factoid."
  },
  {
    "plot": "Ochi",
    "definition": "A sudden interruption of the wordplay flow indicating the end of a rakugo or a kobanashi. ",
    "example": "A Rakugo is a Japanese verbal entertainment usually lasting 30 minutes which ends with a surprise punch line, a narrative stunt known as ochi (fall) or sage(lowering). Twelve kinds of ochi are codified and recognized. The earlier kobanashi was a short comical vignette ending with an ochi."
  },
  {
    "plot": "Plot twist",
    "definition": "Unexpected change ('twist') in the direction or expected outcome of the plot. See also twist ending. ",
    "example": "An early example is the Arabian Nights tale 'The Three Apples'. A locked chest found by a fisherman contains a dead body, and two different men claim to be the murderer, which turns out to be the investigator's own slave."
  },
  {
    "plot": "Poetic justice",
    "definition": "Virtue ultimately rewarded, or vice punished, by an ironic twist of fate related to the character's own conduct ",
    "example": "Wile E. Coyote coming up with a contraption to catch the Road Runner, only to be foiled and caught by his own devices. Each sin's punishment in Dante's Inferno is a symbolic instance of poetic justice."
  },
  {
    "plot": "Predestination paradox",
    "definition": "Time travel paradox where a time traveler is caught in a loop of events that 'predestines' them to travel back in time ",
    "example": "In Doctor Who, the main character repeatedly finds himself under the obligation of having to travel back in time because of something his future character has done."
  },
  {
    "plot": "Quibble",
    "definition": "Plot device based on an argument that an agreement's intended meaning holds no legal value, and that only the exact, literal words agreed on apply. ",
    "example": "For example, William Shakespeare used a quibble in The Merchant of Venice: Portia saves Antonio in a court of law by pointing out that the agreement called for a pound of flesh, but no blood, so Shylock can collect only if he sheds no blood."
  },
  {
    "plot": "Red herring",
    "definition": "Diverting attention away from an item of significance. ",
    "example": "For example, in mystery fiction, an innocent party may be purposefully cast as highly suspicious through emphasis or descriptive techniques to divert attention from the true guilty party."
  },
  {
    "plot": "Self-fulfilling prophecy",
    "definition": "Prediction that, by being made, makes itself come true. ",
    "example": "Early examples include the legend of Oedipus, and the story of Krishna in the Mahabharata. There is also an example of this in Harry Potter when Lord Voldemort heard a prophecy (made by Sybill Trelawney to Dumbledore) that a boy born at the end of July, whose parents had defied Voldemort thrice and survived, would be made marked as his equal. Because of this prophecy, Lord Voldemort sought out Harry Potter (believing him to be the boy spoken of) and tried to kill him. His parents died protecting him, and when Voldemort tried to cast a killing curse on Harry, it rebounded and took away most of his strength, and gave Harry Potter a unique ability and connection with the Dark Lord thus marking him as his equal."
  },
  {
    "plot": "Story within a story (Hypodiegesis) ",
    "definition": "A story told within another story. See also frame story. ",
    "example": "In Stephen King's The Wind Through the Keyhole, of the Dark Tower series, the protagonist tells a story from his past to his companions, and in this story he tells another relatively unrelated story."
  },
  {
    "plot": "Ticking clock scenario",
    "definition": "Threat of impending disaster—often used in thrillers where salvation and escape are essential elements ",
    "example": "In the TV show 24, the main character, Jack Bauer often finds himself interrogating a terrorist who is caught in order to disarm a bomb."
  },
  {
    "plot": "Chekhov's gun",
    "definition": "A dramatic principle that requires every element in a narrative to be irreplaceable, with anything else removed. ",
    "example": "Remove everything that has no relevance to the story. If you say in the first chapter that there is a rifle hanging on the wall, in the second or third chapter it absolutely must go off. If it's not going to be fired, it shouldn't be hanging there."
  },
  {
    "plot": "Unreliable narrator",
    "definition": "The narrator of the story is not sincere, or introduces a bias in their narration and possibly misleads the reader, hiding or minimizing events, characters, or motivations. ",
    "example": "An example is The Murder of Roger Ackroyd. The novel includes an unexpected plot twist at the end of the novel. In the last chapter, Sheppard describes how he was an unreliable narrator."
  }
]
